package main
import "fmt" // подключаем библиотеку fmt через которую мы будем выводить всякое в консоль
 
func main() {
	var hello string // обьявление перерменной hello с типом string

	hello = "Hello from string!" // присваивание переменной значения

	fmt.Println("Hello World!") // если команда она то ; не ставим
	fmt.Println("1");fmt.Println("2") // если писать код в одну строку то надо разделять ;
	fmt.Println(hello)
	fmt.Printf("hello type: %T\n", hello) // Знак %T позволяет узнать тип переменной, к примеру hello string


	// это однострочный комментарий
	/*
		это многострочный комментарий
	*/

	/*
		Запустить проект - go run filename.go
		Билд проекта - go build filename.go
	*/

	// На этот момент я прочитал кучу страниц metanit.com и понял что go это смесь python и C#, лол.

	var p_hello *string // Создание указателя на переменную
	p_hello = &hello // обьявление переменной для указания

	fmt.Println(p_hello) // Выведет адрес на который указывает указатель (масло масляное, я знаю.)
	fmt.Println(*p_hello) // Выведет значение указателя

	var a, b, c, d int = 1, 2, 3, 4 // множественное присваивение к переменным a b c d

	var p_nums[4] *int // Создание массива указателей на значения типа int

	p_nums[0] = &a
	p_nums[1] = &b
	p_nums[2] = &c
	p_nums[3] = &d

	fmt.Println(p_nums) // Допустим выведем в консоль их адреса

	for _, p := range p_nums{
		fmt.Println(*p) // ну и в придачу их значения)
	}

	// рассмотрим структуры

	type person struct{  // обьявляем что это вообще структура
		name, klikuha string // Множественное 
		age int // просто присваивание
	}

	// структуры можно обьявлять как вне функции так и внутри её

	var Tim person = person{"Тимоха", "Красавчик", 18} // Создадим переменную которая соответствует вышесозданной структуре, назовём человека тимоха, дадим кликуху красава и назначим возраст в 18 лет

	fmt.Println("Человека зовут:", Tim.name, "\nего кличка", Tim.klikuha, "\nи ему", Tim.age, "лет") // Познакомимся с тимохой!

	Tim.age = 19 // С днем рождения!

	fmt.Println("Теперь Тимохе", Tim.age, "лет")

	// Теперь создадим анонимную структуру. (Структура без четкого обьявления имени)

	kate := struct{
		name string
		age int
	}{ // Присвоим значения
		name: "Катя",
		age: 20,
	}

	fmt.Println("Человека зовут:", kate.name, "\nи ей", kate.age, "лет") // Познакомимся с катей

	timon := Tim // а давайте у нас будет тимон и тим, но зачем нам обьявлять чето заного если мы можем опять же взять и скопировать данные тимохи?
	timon.age = 15 // если я присвою значение для конкретного человека то для другого оно не поменяется.
	fmt.Println("мы создали человека тимон и ему", timon.age, "лет")
}
